import styles from "../../styles/about.module.scss";
import { Link } from "react-router-dom";
import { ROUTES } from "../../routes/routes,";

const About = () => {
  return (
    <>
      <div className={styles.about}>
        <div className={styles.pages}>
          <Link className={styles.link} to={ROUTES.HOME}>
            Головна
          </Link>{" "}
          / Про нас
        </div>

        <h2 className={styles.title}>Frisson Guitars</h2>

        <div className={styles.container}>
          <div className={styles.top}>
            <div className={styles.left}>
              Ласкаво просимо до нашого онлайн-магазину гітар! Ми пишаємося тим,
              що можемо запропонувати вам широкий асортимент високоякісних гітар
              для музикантів будь-якого рівня. Незалежно від того, чи ви тільки
              починаєте свою музичну подорож, чи вже є досвідченим гітаристом, у
              нас ви знайдете інструмент, який задовольнить усі ваші потреби.
              Наша місія – надихати людей грати на гітарі та допомагати їм
              досягати своїх музичних мрій. Ми прагнемо надавати нашим клієнтам
              найкращий сервіс, якісні інструменти та зручний онлайн-досвід.
            </div>
            <div className={styles.right}></div>
          </div>
          <div className={styles.center}>
            <div className={styles.left}></div>
            <div className={styles.right}>
              Ми співпрацюємо лише з надійними виробниками, щоб забезпечити
              високу якість кожної гітари, яка потрапляє до вашої руки. У нас ви
              знайдете гітари різних брендів, моделей та цінових категорій. Від
              акустичних до електричних – ми маємо все, що вам потрібно. Наша
              команда експертів завжди готова допомогти вам з вибором
              інструменту, відповісти на всі ваші запитання та надати професійні
              поради. Ми зробили процес покупки гітари онлайн максимально
              простим і комфортним, щоб ви могли зосередитися на головному –
              музиці.
            </div>
          </div>
          <div className={styles.bottom}>
            <div className={styles.left}>
              Від класичних моделей до найсучасніших новинок – у нас ви знайдете
              гітару на будь-який смак. Кожна гітара проходить ретельну
              перевірку перед відправкою до клієнта. Ми гарантуємо швидку та
              надійну доставку вашого замовлення прямо до вашого дому. Ми
              пропонуємо вигідні ціни та регулярні знижки, щоб ви могли придбати
              свою мрію без зайвих витрат.
            </div>
            <div className={styles.right}></div>
          </div>
        </div>
      </div>
    </>
  );
};

export default About;
